<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c"%>
<link rel="stylesheet" href="${pageContext.request.contextPath}/resources/assets/libs/quill/dist/quill.snow.css">
<script src="${pageContext.request.contextPath}/resources/assets/libs/quill/dist/quill.js"></script>

<style>
    .custom-height {
        height: 250px; 
        display: flex;
        align-items: center; 
        justify-content: center; 
    }
    table {
        margin: 10px;
    }
    .card {
        width: 400px;
        margin: 10px;
    }
    .chat-container {
        display: flex;
        margin-top: 60px;
    }
    .chat-banner {
        width: 25%;
        height: 70vh;
        position: fixed;
        bottom: 5vh;
        left: 3vh;
        border: 1px solid #ccc;
        border-radius: 10px;
        padding: 20px;
        margin-bottom: 25px;
        background-image: url('${pageContext.request.contextPath}/resources/assets/images/chat/chat.png');
        box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
    }
    .chat-content {
        margin-left: 35%;
        width: 65%;
        padding: 20px;
    }
    #AIChatbox {
        width: 100%;
        height: 70%;
        border: 1px solid #ccc;
        border-radius: 5px;
        padding: 10px;
        background-color: #fff;
        overflow-y: auto;
        overflow-x: hidden;
        margin-top: 80px;
    }
    /* 스크롤바 스타일 */
    #AIChatbox::-webkit-scrollbar {
        width: 8px;
    }
    #AIChatbox::-webkit-scrollbar-thumb {
        background-color: #888;
        border-radius: 10px;
    }
    #AIChatbox::-webkit-scrollbar-thumb:hover {
        background-color: #555;
    }
    #AIChatbox::-webkit-scrollbar-track {
        background: #f1f1f1;
        border-radius: 10px;
    }
    @media screen and (max-width: 768px) {
        .chat-banner {
            width: 100%;
            height: auto;
            position: relative;
            top: 0;
            left: 0;
        }
        .chat-content {
            margin-left: 0;
            width: 100%;
        }
    }
    #linkBtn {
        width: 830px;
        line-height: 1px;
        cursor: pointer;
        height: 60px;
    }
    #linkBtnEx {
        font-size: 25px;
        margin-right: 5px;
    }
    .restrictCard {
        display: flex;
    }
    .restrictBlueWord {
        font-size: 17px;
        color: teal;
    }
    .restrictExWord {
        margin-left: 25px;
    }
    .message-container {
        display: flex;
        margin: 10px 0;
    }
    .user-message {
        background-color: #e2f7e5;
        border-radius: 10px 10px 0 10px;
        padding: 10px;
        max-width: 60%;
        margin-left: auto;
        word-wrap: break-word;
    }
    .response-message {
        background-color: #cce8fb;
        border-radius: 10px 10px 10px 0;
        padding: 10px;
        max-width: 80%;
        margin-right: auto;
        word-wrap: break-word;
    }
</style>
<div class="main-wrapper overflow-hidden">
    <!-- ------------------------------------- -->
    <!-- banner Start -->
    <!-- ------------------------------------- -->
    <section class="bg-primary-subtle custom-height">
        <div class="container-fluid">
            <div class="text-center">
                <p class="text-primary fs-4 fw-bolder">restricted goods</p>
                <h1 class="fw-bolder fs-12">제한 물품</h1>
            </div>
        </div>
    </section>
</div>

<div class="chat-container">
    <div class="chat-banner">
        <!-- <h2>제한 물품 조회</h2> -->
        <!-- <hr/> -->
        <div id="AIChatbox">
            <div class="message-container">
                <div class="response-message">물품을 입력하면 &nbsp;<strong>반입 가능 여부</strong>를 알려드릴게요!</div>
            </div>
            <div id="msg"></div>
            <%--             <c:if test="${not empty userMessage}"> --%>
            <!--                 <div class="message-container"> -->
            <%--                     <div class="user-message">${userMessage}</div> --%>
            <!--                 </div> -->
            <%--             </c:if> --%>
            <%--             <c:if test="${not empty botResponse}"> --%>
            <!--                 <div class="message-container"> -->
            <%--                     <div class="response-message">${botResponse}</div> --%>
            <!--                 </div> -->
            <%--             </c:if> --%>
            <%--             <c:if test="${not empty error}"> --%>
            <!--                 <div class="message-container"> -->
            <%--                     <div class="response-message" style="background-color: #f8d7da; color: #721c24;">${error}</div> --%>
            <!--                 </div> -->
            <%--             </c:if> --%>
        </div>
        <form id="questionForm" action="chat" method="post">
            <div style="display: flex; align-items: center; margin-top:20px;">
                <input type="text" id="userQueInput" name="message" placeholder="물품을 입력하세요..." class="form-control" style="flex: 1; margin-right: 10px; background-color: white !important;"/>
                <button type="submit" id="sendQueBtn" class="btn btn-primary">전송</button>
            </div>
        </form>
    </div>

    <div class="chat-content">
        <h1>제한 물품
		<svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 36 36"><path fill="#dd2e44" d="M18 0C8.059 0 0 8.059 0 18s8.059 18 18 18s18-8.059 18-18S27.941 0 18 0m13 18c0 2.565-.753 4.95-2.035 6.965L11.036 7.036A12.9 12.9 0 0 1 18 5c7.18 0 13 5.821 13 13M5 18c0-2.565.753-4.95 2.036-6.964l17.929 17.929A12.93 12.93 0 0 1 18 31c-7.179 0-13-5.82-13-13"/></svg>
        </h1>
        <hr/>
        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path fill="currentColor" d="M12 8H4a2 2 0 0 0-2 2v4a2 2 0 0 0 2 2h1v4a1 1 0 0 0 1 1h2a1 1 0 0 0 1-1v-4h3l5 4V4zm9.5 4c0 1.71-.96 3.26-2.5 4V8c1.53.75 2.5 2.3 2.5 4"/></svg> 홈페이지 내의 정보는 참고사항으로 정확한 정보는 해당 항공사/기관/시설에 확인하여 주시기 바랍니다.
        <br/><br/><br/><br/>
        보안검색 시 금지물품을 소지하거나 부치는 가방에 금지물품이 포함되어있을 경우 추가적인 보안검색 및 물품포기 등이 발생할 수 있습니다.<br/> 사전에 금지물품 품목을 잘 확인하시어 출국에 불편이 없도록 하시기 바랍니다.
        <br/><br/><br/>
        <div class="card text-bg-dark" id="linkBtn" onclick="window.open('https://www.avsec365.or.kr/avsc/mainMobile.do')">
        	<div class="card-body">
        		<div class="text-center text-white">
        			<span id="linkBtnEx">기내반입 금지물품 상세검색</span> (교통안전공단 홈페이지 바로가기)<svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 24 24"><path fill="none" stroke="black" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M12 6H7a1 1 0 0 0-1 1v10a1 1 0 0 0 1 1h10a1 1 0 0 0 1-1v-5m-6 0l7.5-7.5M15 3h6v6"/></svg>
        		</div>
        	</div>
        </div>
        <br/><br/>
        <div class="restrictCard">
        	<!-- 영상 부 -->
        	<table>
        		<tr>
        			<td><p style="font-size: 20px; color: black">위탁 수하물 금지 물품</p></td>
        		</tr>
        		<tr>
        			<td>
        				<iframe width="400" height="230" src="https://www.youtube.com/embed/_-9bIcSKZo8?si=Ty30Gt4AHA0Jvyq9" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
        			</td>
        		</tr>
        	</table>
        	<table>
        		<tr>
        			<td><p style="font-size: 20px; color: black">기내 반입 금지 물품</p></td>
        		</tr>
        		<tr>
        			<td>
        				<iframe width="400" height="230" src="https://www.youtube.com/embed/AfnXOwHpcIc?si=oK5NTcKqvpuNqycz" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
        			</td>
        		</tr>
        	</table>
        </div>
        <br/>
        	<!-- 카드 부 -->
        <br/><br/><br/>
        <h3>액체류</h3>
        <hr/>
        <div class="restrictCard">
	        <div class="card">
	        	<div class="card-body">
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 24 24"><g fill="none" fill-rule="evenodd"><path d="m12.594 23.258l-.012.002l-.071.035l-.02.004l-.014-.004l-.071-.036q-.016-.004-.024.006l-.004.01l-.017.428l.005.02l.01.013l.104.074l.015.004l.012-.004l.104-.074l.012-.016l.004-.017l-.017-.427q-.004-.016-.016-.018m.264-.113l-.014.002l-.184.093l-.01.01l-.003.011l.018.43l.005.012l.008.008l.201.092q.019.005.029-.008l.004-.014l-.034-.614q-.005-.019-.02-.022m-.715.002a.02.02 0 0 0-.027.006l-.006.014l-.034.614q.001.018.017.024l.015-.002l.201-.093l.01-.008l.003-.011l.018-.43l-.003-.012l-.01-.01z"/><path fill="black" d="M9 2a2 2 0 0 0-2 2v1c0 .378.105.732.288 1.034L5.6 7.3A4 4 0 0 0 4 10.5V18a4 4 0 0 0 4 4h8a4 4 0 0 0 4-4v-7.5a4 4 0 0 0-1.6-3.2l-1.688-1.266A2 2 0 0 0 17 5V4a2 2 0 0 0-2-2zm6 3V4H9v1zm3 8H6v-2h12zM6 15h12v2H6z"/></g></svg>
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 24 24"><path fill="none" stroke="black" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M11.972 20.25h-7.5v1.5a1.5 1.5 0 0 0 1.5 1.5h4.5a1.5 1.5 0 0 0 1.5-1.5zm0 0h-7.5L1.738 2.478A1.5 1.5 0 0 1 3.221.75h10a1.5 1.5 0 0 1 1.482 1.728zm8.308 3v-11l2-3v-8m-4 1h4m-4 3h4m-4 3h4m-14-2v6m-3-3h6"/></svg>
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 256 256"><path fill="black" d="M200 84a12 12 0 0 0 12-12a60.07 60.07 0 0 0-60-60H80a20 20 0 0 0-20 20v48a20 20 0 0 1-20 20a12 12 0 0 0 0 24a44.06 44.06 0 0 0 43.82-40H108v20.62a19.92 19.92 0 0 1-7.51 15.62L84.51 133A43.8 43.8 0 0 0 68 167.38V224a20 20 0 0 0 20 20h104a20 20 0 0 0 20-20v-12.53A274.8 274.8 0 0 0 180.68 84ZM84 36h68a36 36 0 0 1 33.94 24H84Zm104 175.47V220H92v-52.62a19.92 19.92 0 0 1 7.51-15.62l16-12.78A43.8 43.8 0 0 0 132 104.62V84h21.24A250.93 250.93 0 0 1 188 211.47"/></svg>
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 512 512"><path fill="black" d="M96 32v96h128V32c0-17.7-14.3-32-32-32h-64c-17.7 0-32 14.3-32 32m0 128c-53 0-96 43-96 96v208c0 26.5 21.5 48 48 48h224c26.5 0 48-21.5 48-48V256c0-53-43-96-96-96zm64 96a80 80 0 1 1 0 160a80 80 0 1 1 0-160M384 48c0-1.4-1-3-2.2-3.6L352 32L339.6 2.2C339 1 337.4 0 336 0s-3 1-3.6 2.2L320 32l-29.8 12.4c-1.2.6-2.2 2.2-2.2 3.6s1 3 2.2 3.6L320 64l12.4 29.8c.6 1.2 2.2 2.2 3.6 2.2s3-1 3.6-2.2L352 64l29.8-12.4c1.2-.6 2.2-2.2 2.2-3.6m76.4 45.8c.6 1.2 2.2 2.2 3.6 2.2s3-1 3.6-2.2L480 64l29.8-12.4c1.2-.6 2.2-2.2 2.2-3.6s-1-3-2.2-3.6L480 32L467.6 2.2C467 1 465.4 0 464 0s-3 1-3.6 2.2L448 32l-29.8 12.4c-1.2.6-2.2 2.2-2.2 3.6s1 3 2.2 3.6L448 64zm7.2 100.4c-.6-1.2-2.2-2.2-3.6-2.2s-3 1-3.6 2.2L448 224l-29.8 12.4c-1.2.6-2.2 2.2-2.2 3.6s1 3 2.2 3.6L448 256l12.4 29.8c.6 1.2 2.2 2.2 3.6 2.2s3-1 3.6-2.2L480 256l29.8-12.4c1.2-.6 2.2-2.2 2.2-3.6s-1-3-2.2-3.6L480 224zM448 144c0-1.4-1-3-2.2-3.6L416 128l-12.4-29.8C403 97 401.4 96 400 96s-3 1-3.6 2.2L384 128l-29.8 12.4c-1.2.6-2.2 2.2-2.2 3.6s1 3 2.2 3.6L384 160l12.4 29.8c.6 1.2 2.2 2.2 3.6 2.2s3-1 3.6-2.2L416 160l29.8-12.4c1.2-.6 2.2-2.2 2.2-3.6"/></svg>
	        		<hr/>
	        		<p class="restrictBlueWord">액체, 스프레이, 젤 형태의 화장품, 세면용품(치약, 샴푸 등) 또는 의약품류 등</p>
	        		<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					기내 휴대 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
					<p class="restrictExWord">(단, 개별 용기당 100ml 이하로 1인당 1L 비닐 지퍼백(20.5cm*20.5cm / 15cm*25cm) 1개에 한해 반입 가능하며, 국내선은 제한 없음)</p>
					<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					위탁수하물 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.1em" height="1.1em" viewBox="0 0 1536 1536"><path fill="#2d82f0" d="M768 224q-148 0-273 73T297 495t-73 273t73 273t198 198t273 73t273-73t198-198t73-273t-73-273t-198-198t-273-73m768 544q0 209-103 385.5T1153.5 1433T768 1536t-385.5-103T103 1153.5T0 768t103-385.5T382.5 103T768 0t385.5 103T1433 382.5T1536 768"/></svg>
					<p class="restrictExWord">(단, 인화성이 없는 스프레이류는 항공위험물운송기준에 따라 총2kg(2L) 범위 내에서 1개당 500g(500ml) 이하로만 반입 가능)</p>
	        	</div>
	        </div>
	        
	        <div class="card">
	        	<div class="card-body">
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 24 24"><path fill="black" d="M21 15c0-4.625-3.507-8.441-8-8.941V4h-2v2.059c-4.493.5-8 4.316-8 8.941v2h18zM2 18h20v2H2z"/></svg>
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 48 48"><defs><mask id="ipTBowl0"><g fill="black" stroke="#fff" stroke-linecap="round" stroke-linejoin="round" stroke-width="4"><path fill="#555" d="M32 44s0-3.864.002-3.872a18 18 0 0 0 4.726-3.4A17.94 17.94 0 0 0 42 24H6c0 4.97 2.015 9.47 5.272 12.728a18.1 18.1 0 0 0 4.741 3.407L16 44z"/><path d="M24 18.008V8m12 10.008V12m-24 6.008V12m28-4a4 4 0 0 0-4 4m-8-8a4 4 0 0 0-4 4m-8 0a4 4 0 0 0-4 4"/></g></mask></defs><path fill="currentColor" d="M0 0h48v48H0z" mask="url(#ipTBowl0)"/></svg>
	        		 <svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 512 512"><path fill="black" d="M144 73c-7.5 0-17.6 6.44-28 20.59C105.6 107.7 95.27 128.6 86.47 153c-16.66 46.3-28.04 105.4-29.24 158h45.87c.8-54.6 8.6-115.1 22.2-163.4c7.2-25.6 15.8-47.71 26.4-64.2c1-1.51 2-2.96 3-4.39c-.7-.85-1.3-1.61-1.9-2.24c-2.8-2.75-5-3.77-8.8-3.77m48 0c-7.5 0-16.2 6.08-25.2 20.1c-8.9 14-17.3 34.9-24.1 59.3c-13 46.3-20.7 105.6-21.5 158.6H183c.4-54.2 4.5-114.5 14.2-162.8c4.1-20.4 9-38.6 15.5-53.55q-.6-1.425-1.2-2.76c-3-6.87-6.4-11.86-9.7-14.81S195.8 73 192 73m64 0c-7.5 0-14.8 5.66-22.3 19.53s-14 34.77-18.9 59.27c-9.3 46.4-13.2 105.8-13.6 159.2h109.6c-.4-53.4-4.3-112.8-13.6-159.2c-4.9-24.5-11.4-45.4-18.9-59.27S263.5 73 256 73m64 0c-3.8 0-6.5 1.13-9.8 4.08s-6.7 7.94-9.7 14.81q-.6 1.335-1.2 2.76c6.5 14.95 11.4 33.15 15.5 53.55c9.7 48.3 13.8 108.6 14.2 162.8h61.8c-.8-53-8.5-112.3-21.5-158.6c-6.8-24.4-15.2-45.3-24.1-59.3c-9-14.02-17.7-20.1-25.2-20.1m48 0c-3.7 0-6 1.02-8.8 3.77c-.6.63-1.2 1.39-1.9 2.24c1 1.43 2 2.88 3 4.39c10.6 16.49 19.2 38.6 26.4 64.2c13.6 48.3 21.4 108.8 22.2 163.4h45.9c-1.2-52.6-12.6-111.7-29.3-158c-8.8-24.4-19.1-45.3-29.5-59.41C385.6 79.44 375.5 73 368 73M187.7 88.36c3.8.05 4.8 5.73 1.8 11.64c-14.1 25.2-31.2 70.5-41.4 98.1c-.7-27.2 18-85.3 34.1-106.89c2.2-2.03 4.1-2.87 5.5-2.85m-55.9.65c3.1.1 5.6 4.05 4.2 7.82c-23.8 28.77-32.1 57.67-43.91 86.47c4.13-37.8 18.11-64.8 35.41-91.65c1.3-1.93 2.9-2.68 4.3-2.64m192.8 1.58q2.25 0 4.8.24c-11.3 7.99-14.4 12.87-16.3 20.47c-3.6-13.42-2.6-20.72 11.5-20.71M254 92.31c3.3.06 5.4 3.71 4.2 7.79c-16.2 38.8-32 78.7-37 121.1c-4.5-30.1 1.6-88.2 26-124.43c2.4-3.24 4.9-4.5 6.8-4.46M41.54 329c2.35 21.3 13.22 32.9 26.26 46h376.4c13-13.1 23.9-24.7 26.3-46zM224 393v51l-80 48h224l-80-48v-51z"/></svg>
	        		<hr/>
	        		<p class="restrictBlueWord">고추장/김치 등 액체가 포함되어 있거나 젤 형태의 음식물류</p>
	        		<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					기내 휴대 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
					<p class="restrictExWord">(단, 개별 용기당 100ml 이하로 1인당 1L 비닐 지퍼백(20.5cm*20.5cm / 15cm*25cm) 1개에 한해 반입 가능하며, 국내선은 제한 없음)</p>
					<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					위탁수하물 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.1em" height="1.1em" viewBox="0 0 1536 1536"><path fill="#2d82f0" d="M768 224q-148 0-273 73T297 495t-73 273t73 273t198 198t273 73t273-73t198-198t73-273t-73-273t-198-198t-273-73m768 544q0 209-103 385.5T1153.5 1433T768 1536t-385.5-103T103 1153.5T0 768t103-385.5T382.5 103T768 0t385.5 103T1433 382.5T1536 768"/></svg>
					<p class="restrictExWord">(용량 제한 없이 가능)</p>
	        	</div>
	        </div>
        </div>
        <br/><br/><br/>
        <h3>위해물품</h3>
        <hr/>
        <div class="restrictCard">
        <div class="card">
        	<div class="card-body">
        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 256 256"><path fill="black" d="M236 49a25 25 0 0 0-42.63-17.66l-50.21 50.2L18.34 206.4a8 8 0 0 0 3.86 13.45A160.7 160.7 0 0 0 58.4 224c32.95 0 65.91-10.2 96.94-30.23c31.76-20.5 50.19-43.82 51-44.8a8 8 0 0 0-.64-10.59L181.31 114l47.38-47.39A24.84 24.84 0 0 0 236 49m-89.77 131.6c-34.43 22.1-69.94 30.92-105.76 26.3L146 101.34l43.09 43.1a220 220 0 0 1-42.86 36.16"/></svg>
        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 26 26"><path fill="black" d="M20.344 0c-1.317 0-2.602.53-3.657 1.438c-.006.005-.024-.006-.03 0a1 1 0 0 0-.313.218l-12.969 13a1.93 1.93 0 0 0-.531 1.219c-.015.361.06.635.094.875l.25 1.688l-2 2l1.093 5.468L6.47 21.72l1.687.25c.205.032.483.107.844.093a1.88 1.88 0 0 0 1.25-.53L19.781 12c.464-.465 1.198-.767 2.032-1.063c.833-.295 1.778-.528 2.53-1.28c2.199-2.199 2.199-5.803 0-8a5.66 5.66 0 0 0-4-1.657zm-2 2.594l5.062 5.031c-.137.21-.283.408-.468.594c-.222.22-.912.503-1.782.812s-1.925.705-2.781 1.563l-9.438 9.469h-.03c-.091 0-.247-.033-.438-.063h-.031l-3.094-.469l-.438-3.062c-.032-.236-.06-.389-.062-.469L17.625 3.187a1 1 0 0 0 .156-.124c.18-.18.362-.336.563-.47zM16.906 5.75l-9.625 9.594l2.282 2.281L19.155 8zm-2.093 3.563l.78.75l-2.28 2.28l-.75-.75z"/></svg>
        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 512 512"><path fill="black" d="m395.13 313l89.869-100.857H388.08c-45.748 0-82.824-37.063-82.824-82.824l-.297-33.208l-100.857-77.147v96.917c0 45.751-37.06 82.824-82.822 82.824l-9.844.298L27.001 299.86h96.92c45.75 0 82.822 37.062 82.822 82.824l.298 20.484l100.854 89.868v-96.913c0-45.749 37.062-82.823 82.824-82.823zM256 306.669c-27.99 0-50.666-22.685-50.666-50.665c0-27.99 22.679-50.671 50.665-50.671c27.99 0 50.67 22.682 50.67 50.671c0 27.98-22.683 50.665-50.67 50.665z"/></svg>
        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 512 512"><path fill="black" d="M134.745 22.098c-4.538-.146-9.08 1.43-14.893 7.243c-5.586 5.586-11.841 21.725-15.248 35.992c-.234.979-.444 1.907-.654 2.836l114.254 105.338c-7.18-28.538-17.555-59.985-29.848-86.75c-11.673-25.418-25.249-46.657-37.514-57.024c-6.132-5.183-11.56-7.488-16.097-7.635M92.528 82.122L82.124 92.526L243.58 267.651l24.072-24.072zm-24.357 21.826c-.929.21-1.857.42-2.836.654c-14.267 3.407-30.406 9.662-35.993 15.248c-5.813 5.813-7.39 10.355-7.244 14.893c.147 4.538 2.452 9.965 7.635 16.098c10.367 12.265 31.608 25.842 57.025 37.515c26.766 12.293 58.211 22.669 86.749 29.848L68.17 103.948zM280.899 255.79l-25.107 25.107l73.265 79.469l31.31-31.31zm92.715 85.476l-32.346 32.344l2.07 2.246c.061.058 4.419 4.224 10.585 6.28c6.208 2.069 12.71 2.88 21.902-6.313s8.38-15.694 6.31-21.902c-2.057-6.174-6.235-10.54-6.283-10.59zm20.172 41.059a46 46 0 0 1-5.233 6.226a46 46 0 0 1-6.226 5.235L489.91 489.91z"/></svg>
        		<hr/>
        		<p class="restrictBlueWord">창 / 도검류 등</p>
        		<br/>
				<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
				기내 휴대 
				<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
				<p class="restrictExWord"></p>
				<br/>
				<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
				위탁수하물 
				<svg xmlns="http://www.w3.org/2000/svg" width="1.1em" height="1.1em" viewBox="0 0 1536 1536"><path fill="#2d82f0" d="M768 224q-148 0-273 73T297 495t-73 273t73 273t198 198t273 73t273-73t198-198t73-273t-73-273t-198-198t-273-73m768 544q0 209-103 385.5T1153.5 1433T768 1536t-385.5-103T103 1153.5T0 768t103-385.5T382.5 103T768 0t385.5 103T1433 382.5T1536 768"/></svg>
				<p class="restrictExWord">(단, 둥근 날을 가진 버터칼, 안전날이 포함된 면도기, 안전면도날, 전기면도기 및 기내식 전용 나이프(항공사 소유)는 기내 휴대 반입가능)</p>
        	</div>
        </div>
	        <div class="card">
	        	<div class="card-body">
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 24 24"><path fill="black" d="M14.69 2.21L4.33 11.49c-.64.58-.28 1.65.58 1.73L13 14l-4.85 6.76c-.22.31-.19.74.08 1.01c.3.3.77.31 1.08.02l10.36-9.28c.64-.58.28-1.65-.58-1.73L11 10l4.85-6.76c.22-.31.19-.74-.08-1.01a.77.77 0 0 0-1.08-.02"/></svg>
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 512 512"><path fill="black" d="m79.238 115.768l-28.51 67.863h406.15l-.273-67.862h-263.83v55.605h-15v-55.605h-16.68v55.605H146.1v-55.605h-17.434v55.605h-15v-55.605H79.238zm387.834 15.96v40.66h18.688v-40.66zM56.768 198.63l20.566 32.015L28.894 406.5l101.68 7.174l21.54-97.996h115.74l14.664-80.252l174.55-3.873l-.13-32.922H56.767zm206.672 37.22l-11.17 61.142h-96.05l12.98-59.05l12.53-.278l-2.224 35.5l14.262 13.576l1.003-33.65l24.69-16.264l43.98-.976z"/></svg>
					<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 512 512"><path fill="black" d="M317.096 24.062c-5.96-.065-11.61 1.097-16.576 3.46c-2.844 1.352-5.54 3.216-7.788 5.53q-.606-.316-1.222-.597c-6.663-3.06-14.516-3.974-22.662-2.682c-8.147 1.293-15.333 4.59-20.72 9.565c-2.037 1.88-3.847 4.1-5.247 6.564c-6.555-1.378-13.72-.858-20.835 1.502c-7.83 2.598-14.383 7.017-18.893 12.8c-4.183 5.363-6.702 12.536-5.017 19.657c-5.716 2.527-10.943 6.68-15.26 12.136c-3.33 4.207-5.778 8.764-7.252 13.445c.43-.01.86-.034 1.29-.036c5.77-.025 11.553.883 17.1 2.524a25.5 25.5 0 0 1 2.977-4.762v-.002c3.106-3.925 6.97-6.464 9.924-7.422c1.108-.36 1.986-.517 2.682-.547c1.16-.05 1.814.252 2.19.55c.605.48 1.38 1.646 1.128 4.743s-1.84 7.438-4.945 11.363q-.581.734-1.19 1.4c5.297 2.93 10.147 6.647 14.202 11.11q.562-.654 1.104-1.34c5.118-6.467 8.172-13.76 8.768-21.07c.143-1.763.12-3.568-.077-5.362a45 45 0 0 0 7.014-1.73c7.83-2.597 14.386-7.016 18.896-12.798a28 28 0 0 0 2.45-3.718c5.426 1.51 11.403 1.79 17.548.814c8.146-1.293 15.332-4.59 20.72-9.562a29 29 0 0 0 1.744-1.764c4.798 3.164 10.53 5.28 16.825 6.19c5.96.865 11.75.552 17.017-.905c2.08 6.164 5.987 11.935 11.37 16.81c3.32 3.005 6.922 5.413 10.68 7.165c-.11.8-.19 1.6-.23 2.396c-.383 7.323 1.673 14.957 5.885 22.05l.06.1c4.868-3.6 10.38-6.292 16.173-8.12a25 25 0 0 1-.756-1.172c-2.557-4.305-3.55-8.82-3.387-11.922c.006-.116.02-.21.027-.32c2.807-.41 5.552-1.292 8.045-2.735c2.478 1.582 5.233 4.258 7.352 7.826a25.6 25.6 0 0 1 2.477 5.635c2.363-.2 4.74-.28 7.112-.21c3.896.113 7.777.604 11.555 1.503c-.662-5.44-2.587-10.924-5.672-16.118c-3.44-5.793-7.886-10.495-13.003-13.75c.444-3.374.175-6.83-.637-10.053c-1.792-7.11-6.005-13.8-12.12-19.337s-13.186-9.068-20.44-10.148a27.8 27.8 0 0 0-7-.162c-1.52-3.352-3.822-6.33-6.493-8.73c-5.455-4.9-12.682-8.1-20.846-9.284a45.5 45.5 0 0 0-6.048-.478zm-.153 18.022c1.167.004 2.38.09 3.62.27c4.954.717 9.087 2.782 11.398 4.86c2.312 2.075 2.555 3.455 2.444 4.217c-.11.764-.733 2.02-3.54 3.355c-2.804 1.335-7.355 2.14-12.31 1.422c-4.954-.718-9.087-2.78-11.398-4.858c-.85-.764-1.417-1.433-1.793-2.012l-.006-.045a19 19 0 0 0-.572-2.48c.234-.77 1.02-1.87 3.467-3.036c2.104-1 5.19-1.706 8.69-1.693m-41.66 5.15c3.5-.06 6.596.604 8.713 1.576c1.662.764 2.555 1.507 3.043 2.147c.13.703.288 1.398.487 2.08c-.184.796-.773 1.89-2.332 3.33c-2.283 2.107-6.39 4.227-11.334 5.012c-4.943.783-9.502.038-12.325-1.26c-.24-.11-.442-.216-.65-.325a19.7 19.7 0 0 0-2.604-4.674c.336-.69.952-1.537 2.056-2.556c2.283-2.107 6.388-4.23 11.332-5.013a26 26 0 0 1 3.615-.316zm77.574 13.137c.555-.01 1.207.033 1.975.147c3.073.458 7.3 2.328 11.01 5.688s5.988 7.382 6.748 10.394c.112.443.187.84.246 1.21c-2.575.352-5.115 1.17-7.498 2.586c-.475.282-.927.583-1.367.897c-2.415-.942-5.08-2.494-7.527-4.71c-3.71-3.36-5.986-7.38-6.746-10.394c-.76-3.013-.19-4.293.328-4.864c.388-.428 1.17-.926 2.832-.955zm-116.752 2.82c1.502.038 2.853.23 3.977.538c.545.15.997.31 1.408.477a21 21 0 0 0 2.48 4.312c-.257.672-.706 1.484-1.478 2.473c-1.91 2.45-5.618 5.21-10.37 6.785c-4.75 1.577-9.372 1.582-12.368.76s-3.83-1.95-4.072-2.68c-.243-.73-.25-2.132 1.662-4.582c1.91-2.45 5.62-5.208 10.37-6.785c2.97-.985 5.89-1.357 8.39-1.297zm-59.017 60.292c-3.486.012-6.73.665-9.764 1.637l-14.98 41.716c14.94-.53 30.592 4.598 43.185 15.844l15.087-42.016c-4.048-6.298-10.983-11.72-19.174-14.66c-4.705-1.69-9.648-2.538-14.355-2.522zm218.244 5.137c-1.85.013-3.715.147-5.572.403c-8.62 1.19-16.524 5.063-21.783 10.39l6.056 43.91c12.994-7.39 29.24-10.098 45.612-5.968l-6.1-44.224c-4.637-2.64-10.297-4.275-16.37-4.486q-.916-.031-1.843-.025m-241.19 56.052c-2.94.025-5.81.362-8.552.974L94.25 328.62c15.76.55 31.143 6.467 43.572 14.772l51.006-142.04c-9.503-11.752-22.635-16.785-34.687-16.68zm249.655 8.53c-10.492.133-20.068 4.036-27.033 9.923l20.38 147.762c9.636-4.558 20.245-6.874 30.696-7.38a93 93 0 0 1 14.785.47l-20.27-146.973c-6.27-2.718-12.563-3.876-18.558-3.8zM97.385 347.1l4.88 25.26l21.296-16.432c-7.988-4.428-17.244-7.707-26.175-8.828zm335.185 14.537c-8.24.1-16.79 1.497-24.318 4.29l15.994 20.153l11.3-24.412a74 74 0 0 0-2.976-.03zm-350.523.966L69.453 397.68l16.857-13.01l-4.263-22.07zm43.723 14.357l-19.686 15.19l4.977 25.77zm321.664 1.88l-10.66 23.028l16.746 21.102zm-45.284 8.354l4.953 35.917l8.676-18.742l-13.63-17.174zM90.13 404.46l-18.38 14.18c4.486.312 9.058 1.267 13.574 2.89a51.4 51.4 0 0 1 8.906 4.183zm338.18 15.694l-11.498 24.832c4.772-2.43 10.122-4.116 15.85-4.906a51.2 51.2 0 0 1 11.203-.322zm-358.726 16.42c-3.068-.114-5.913.254-8.322.996c-4.818 1.484-7.593 4.06-8.737 7.244c-1.144 3.186-.64 6.937 2.133 11.147s7.846 8.375 14.445 10.745s13.165 2.384 17.983.9s7.59-4.06 8.734-7.246s.643-6.936-2.13-11.145c-2.774-4.21-7.848-8.376-14.448-10.746c-3.3-1.186-6.59-1.782-9.658-1.896zm370.627 21.03a33 33 0 0 0-5.087.306c-6.947.958-12.77 3.986-16.352 7.533c-3.58 3.548-4.846 7.116-4.383 10.47c.462 3.352 2.646 6.444 7.054 8.89c4.41 2.445 10.834 3.784 17.78 2.826c6.947-.96 12.77-3.99 16.352-7.536c3.582-3.548 4.846-7.114 4.383-10.467c-.462-3.353-2.644-6.445-7.053-8.89c-3.306-1.835-7.747-3.047-12.69-3.134z"/></svg>
	        		<hr/>
	        		<p class="restrictBlueWord">전자충격기, 총기, 무술호신용품 등</p>
	        		<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					기내 휴대 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
					<p class="restrictExWord"></p>
					<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					위탁수하물 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.1em" height="1.1em" viewBox="0 0 1536 1536"><path fill="#2d82f0" d="M768 224q-148 0-273 73T297 495t-73 273t73 273t198 198t273 73t273-73t198-198t73-273t-73-273t-198-198t-273-73m768 544q0 209-103 385.5T1153.5 1433T768 1536t-385.5-103T103 1153.5T0 768t103-385.5T382.5 103T768 0t385.5 103T1433 382.5T1536 768"/></svg>
					<p class="restrictExWord">(단, 위탁수하물로 반입할 경우, 해당 항공운송사업자에게 총기소지허가서 또는 수출입허가서 등 관련서류를 확인시키고, 총알과 분리한 후, 단단히 보관함에 넣은 경우에만 가능)<br><br>(총기류 부품 중 조준경은 기내 휴대 및 위탁수하물 반입가능)</p>
	        	</div>
	        </div>
	        <!-- <div class="card">
	        	<div class="card-body">
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 24 24"><g fill="none" stroke="black" stroke-linejoin="round" stroke-width="2"><path d="m20.953 11.763l-2.052-2.052l-2.052 2.052l2.052 2.053zm-1.368-2.736L15.48 4.922l-3.42 3.42l4.105 4.105zm-4.105 2.736l-2.736-2.736l-8.21 8.21l2.737 2.736z"/><path d="m12.93 3.74l1.866 1.867l-2.052 2.052l-1.555-1.555c-.995-.995-3.234-.497-3.918.187l2.737-2.737c.684-.684 1.99-.746 2.923.187Z"/></g></svg>
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 24 24"><path fill="none" stroke="black" stroke-linecap="round" stroke-linejoin="round" stroke-width="1.5" d="M11.42 15.17L17.25 21A2.652 2.652 0 0 0 21 17.25l-5.877-5.877M11.42 15.17l2.496-3.03c.317-.384.74-.626 1.208-.766M11.42 15.17l-4.655 5.653a2.548 2.548 0 1 1-3.586-3.586l6.837-5.63m5.108-.233c.55-.164 1.163-.188 1.743-.14q.19.017.384.017a4.5 4.5 0 0 0 4.102-6.352l-3.276 3.276a3 3 0 0 1-2.25-2.25l3.276-3.276a4.5 4.5 0 0 0-6.336 4.486c.091 1.076-.071 2.264-.904 2.95l-.102.085m-1.745 1.437L5.909 7.5H4.5L2.25 3.75l1.5-1.5L7.5 4.5v1.409l4.26 4.26m-1.745 1.437l1.745-1.437m6.615 8.206L15.75 15.75M4.867 19.125h.008v.008h-.008z"/></svg>
					<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 512 512"><path fill="black" d="M329.78 20.344c-.842.003-1.687.005-2.53.03c-25.534.782-51.27 11.864-71.53 32.064c-40.637 40.512-45.503 99.74-12.75 162.156c7.468-7.77 17.948-12.625 29.5-12.625c1.63 0 3.228.123 4.81.31c-7.385-12.674-12.023-25.99-13.467-39.686c-2.692-25.526 5.91-51.74 25.906-75.594c17.222-20.545 42.123-29.6 66.967-32.313c15.924-1.738 31.875-.833 46.72 1.25c-21.29-24.748-47.497-35.683-73.626-35.593zm127.94 89.75c2.057 14.84 2.9 30.782 1.06 46.687c-2.86 24.738-12.102 49.482-32.686 66.626c-23.92 19.92-50.076 28.506-75.563 25.813c-12.917-1.366-25.496-5.572-37.53-12.25a41 41 0 0 1 .438 5.968c0 11.155-4.536 21.308-11.844 28.718C363.07 302.49 421.276 296.65 461.28 256.78c23.21-23.127 34.594-52.96 31.97-81.81c-2.11-23.183-13.242-45.94-35.53-64.876M272.47 220.656c-12.417 0-22.283 9.866-22.283 22.28c0 12.417 9.866 22.283 22.282 22.283c12.414 0 22.28-9.867 22.28-22.283c0-12.415-9.866-22.28-22.28-22.28zm-39.72 12.25C161.344 259.196 83.694 294.76 19.094 348.03v82.376c67.566-58.922 143.974-114.322 208.72-145.25c-31.175 64.465-87.04 140.404-146.158 207.688h78.72c52.763-63.457 90.673-139.32 118-209.375c-1.93.28-3.903.436-5.907.436c-22.517 0-40.97-18.452-40.97-40.97c0-3.46.43-6.812 1.25-10.03z"/></svg>
	        		<hr/>
	        		<p class="restrictBlueWord">공구류</p>
	        		<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					기내 휴대 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
					<p class="restrictExWord"></p>
					<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					위탁수하물
					<svg xmlns="http://www.w3.org/2000/svg" width="1.1em" height="1.1em" viewBox="0 0 1536 1536"><path fill="#2d82f0" d="M768 224q-148 0-273 73T297 495t-73 273t73 273t198 198t273 73t273-73t198-198t73-273t-73-273t-198-198t-273-73m768 544q0 209-103 385.5T1153.5 1433T768 1536t-385.5-103T103 1153.5T0 768t103-385.5T382.5 103T768 0t385.5 103T1433 382.5T1536 768"/></svg>
					<p class="restrictExWord"></p>
	        	</div>
	        </div> -->
	    </div>
        <br/><br/><br/>
        <h3>위험물</h3>
        <hr/>
        <div class="restrictCard">
        <div class="card">
        	<div class="card-body">
        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 24 24"><g fill="black"><path d="M6 15a1 1 0 0 1-1-1v-4a1 1 0 0 1 1-1h6v6z"/><path fill-rule="evenodd" d="M18 6H5a3 3 0 0 0-3 3v6a3 3 0 0 0 3 3h13a3 3 0 0 0 3-3a1 1 0 0 0 1-1v-4a1 1 0 0 0-1-1a3 3 0 0 0-3-3m0 2H5a1 1 0 0 0-1 1v6a1 1 0 0 0 1 1h13a1 1 0 0 0 1-1V9a1 1 0 0 0-1-1" clip-rule="evenodd"/></g></svg>
        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 48 48"><path fill="none" stroke="black" stroke-linecap="round" stroke-linejoin="round" stroke-width="4" d="M43 12H3v30h40zM11 6H3v6h8zm32 0h-8v6h8zM9 21h6m16 0h6m-25-3v6"/></svg>
        		<hr/>
        		<p class="restrictBlueWord">리튬이온배터리 등</p>
        		<br/>
				<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
				기내 휴대 
				<svg xmlns="http://www.w3.org/2000/svg" width="1.1em" height="1.1em" viewBox="0 0 1536 1536"><path fill="#2d82f0" d="M768 224q-148 0-273 73T297 495t-73 273t73 273t198 198t273 73t273-73t198-198t73-273t-73-273t-198-198t-273-73m768 544q0 209-103 385.5T1153.5 1433T768 1536t-385.5-103T103 1153.5T0 768t103-385.5T382.5 103T768 0t385.5 103T1433 382.5T1536 768"/></svg>
				<p class="restrictExWord">- 여분배터리 100Wh 이하 : 제한 없이 가능<br/>- 여분배터리 100Wh 초과 ~ 160Wh 이하 : 항공사 승인 하에 기내 휴대로 1인당 2개 반입 가능<br/>- 여분배터리 160Wh 초과 : 반입 불가<br/> 
				<br/>
				<svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 20 20"><path fill="black" d="M10 0a10 10 0 1 0 10 10A10 10 0 0 0 10 0m1 16H9v-2h2zm0-4H9V4h2z"/></svg>
				 위 기준은 항공사 마다 상이하므로 각 항공사에 문의 필요</p>
				<br/>
				<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
				위탁수하물 
				<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
				<p class="restrictExWord"></p>
        	</div>
        </div>
	        <div class="card">
	        	<div class="card-body">
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 16 16"><path fill="black" d="M14 1.5a.5.5 0 1 1 1 0a.5.5 0 0 1-1 0m-2 1a.5.5 0 1 1 1 0a.5.5 0 0 1-1 0M10.5 4a.5.5 0 1 0 0-1a.5.5 0 0 0 0 1m2 0a.5.5 0 1 0 0 1a.5.5 0 0 0 0-1m2-1a.5.5 0 1 0 0 1a.5.5 0 0 0 0-1M14 5.5a.5.5 0 1 1 1 0a.5.5 0 0 1-1 0m-3.012.936a.5.5 0 0 0-.134-.29L9 4.292V2.5a.5.5 0 0 0-.5-.5H6.501a.5.5 0 0 0-.5.5v1.793L4.147 6.146a.5.5 0 0 0-.134.29l-.004.017l-.002.009A.1.1 0 0 0 4 6.5v6.75c0 .966.784 1.75 1.75 1.75h3.5A1.75 1.75 0 0 0 11 13.25V6.5q-.001-.017-.005-.031l-.002-.007zM7.001 3h1v1h-1zm-.293 2h1.586l1 1H5.708z"/></svg>
	        		<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 512 512"><path fill="black" d="M126.432 21.703C98.68 21.46 75.306 45.737 71.037 98.338c18.902-39.768 56.02-37.664 90.242-10.684c-21.53 3.334-45.143 20.344-64.755 54.547c55.164-33.098 94.772-13.63 125.823 34.79c1.478 4.1 2.862 8.27 4.123 12.512a250 250 0 0 0 3.745 19.766c-26.753-28.924-74.47-36.722-109.543-4.444c32.49-1.888 59.49 7.64 82.44 25.598a210 210 0 0 1 47.34-6.285c1.053-.02 2.107-.006 3.16-.008c3.113-103.32 38.217-159.337 86.663-132.75c23.023 12.632 19.488 44.942-7.33 53.854c55.25-11.45 64.983-62.343 12.108-92.87c-44.98-25.97-111.334 6.87-119.967 88.54c-18.207-76.27-62.206-118.883-98.654-119.2zm320.822 2.203a72 72 0 0 0-1.91.004c-10.92.172-23.576 2.88-37.9 8.71c80.755-13.584 53.78 108.933-10.61 123.8c39.666-29.354 31.538-57.157 15.918-83.12c-5.8 83.094-100.58 103.93-144.225 151.337c9.65.71 19.206 2.147 28.502 4.35c19.623-14.667 44.268-25.297 73.234-31.868C510.48 165.305 527.36 24.83 447.254 23.905zm-126.717 78.942c-29.023-.357-36.66 48.594 3.772 42.158c-14.98-5.534-16.07-27.595.66-41.735a27.6 27.6 0 0 0-4.433-.422zM21.75 172.275c-23.62 69.475 37.823 92.292 81.938 42.848c-41.72 8.173-72.115-1.308-81.938-42.848m233.67 71.11a193 193 0 0 0-4.873.023c-25.75.45-51.578 5.98-72.942 15.655c20.642 34.628 35.932 78.964 35.932 129.195v7.586l-7.426 1.558c-42.726 8.963-67.727 45.533-75.682 94.598h192.416c-2.138-33.135-14.294-58.505-44.528-78.97c42.66 2.888 67.743 47.175 72.92 78.97h19.313c-8.08-48.734-34.184-85.43-76.786-94.607l-7.377-1.59v-7.545c0-53.404 16.483-95.637 37.23-129.69c-7.127-3.66-14.8-6.613-22.826-8.92c-16.314 37.33-30.004 83.224-33.06 141.864c-3.023-58.476.62-108.805 7.83-146.87a184 184 0 0 0-20.14-1.257z"/></svg>
					<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 14 14"><g fill="none" stroke="black" stroke-linecap="round" stroke-linejoin="round"><path d="M7 10.99a3.5 3.5 0 1 0 0-7a3.5 3.5 0 0 0 0 7"/><path d="M9.35 1.31a3.32 3.32 0 1 1-4.7 0"/><path d="M.5 8.5a3.32 3.32 0 1 1 2.35 4.07"/><path d="M11.15 12.57A3.32 3.32 0 1 1 13.5 8.5"/></g></svg>
					<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 16 16"><g fill="black"><path d="M8 1a7 7 0 1 0 0 14A7 7 0 0 0 8 1M0 8a8 8 0 1 1 16 0A8 8 0 0 1 0 8"/><path d="M9.653 5.496A3 3 0 0 0 8 5c-.61 0-1.179.183-1.653.496L4.694 2.992A5.97 5.97 0 0 1 8 2c1.222 0 2.358.365 3.306.992zm1.342 2.324a3 3 0 0 1-.884 2.312a3 3 0 0 1-.769.552l1.342 2.683c.57-.286 1.09-.66 1.538-1.103a6 6 0 0 0 1.767-4.624zm-5.679 5.548l1.342-2.684A3 3 0 0 1 5.005 7.82l-2.994-.18a6 6 0 0 0 3.306 5.728ZM10 8a2 2 0 1 1-4 0a2 2 0 0 1 4 0"/></g></svg>
	        		<hr/>
	        		<p class="restrictBlueWord">인화성 가스액체, 방사능물질 등</p>
	        		<br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					기내 휴대 
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
					<p class="restrictExWord"></p>
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 100 100"><path fill="black" d="M50 37.45c-6.89 0-12.55 5.66-12.55 12.549c0 6.89 5.66 12.55 12.55 12.55c6.655 0 12.112-5.294 12.48-11.862a3.5 3.5 0 0 0 .07-.688a3.5 3.5 0 0 0-.07-.691C62.11 42.74 56.653 37.45 50 37.45m0 7c3.107 0 5.55 2.442 5.55 5.549s-2.443 5.55-5.55 5.55s-5.55-2.443-5.55-5.55S46.892 44.45 50 44.45" color="black"/></svg>
					위탁수하물
					<svg xmlns="http://www.w3.org/2000/svg" width="1.5em" height="1.5em" viewBox="0 0 72 72"><path fill="#ea5a47" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.217 36l-14.36 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/><path fill="none" stroke="#000" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="2" d="m58.14 21.78l-7.76-8.013l-14.29 14.22l-14.22-14.22l-8.013 8.013L28.207 36l-14.35 14.22l8.014 8.013l14.22-14.22l14.29 14.22l7.76-8.013L43.921 36z"/></svg>
					<br/><br/>
					<svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 20 20"><path fill="black" d="M10 0a10 10 0 1 0 10 10A10 10 0 0 0 10 0m1 16H9v-2h2zm0-4H9V4h2z"/></svg>
					 스프레이류는 교통안전공단 홈페이지에서 상세정보 확인
	        	</div>
	        </div>
	    </div>
    </div>
</div>
<script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
<script type="text/javascript">
    $(function(){
        var chatBox = $("#AIChatbox");
        var userInput = $("#userQueInput");

        // 질문 전송 함수
        function sendQuestion() {
            var question = userInput.val();
            if (question.trim() === "") return; // 빈 질문은 무시

            // 사용자 질문 표시
            var chatStr = "<div class='message-container'>";
            chatStr +=   "<div class='user-message'>"+question+"</div>";
            chatStr += "</div>";
            $('#msg').append(chatStr);
            userInput.val(""); // 입력 창 초기화
            chatBox.scrollTop(chatBox[0].scrollHeight);

            $.ajax({
                url: "/chat",
                type: "post",
                data: {message: question},
                success: function(result){
                    // 대답 표시
                    var responseStr = "<div class='message-container'>";
                    responseStr +=   "<div class='response-message'>"+result+"</div>";
                    responseStr += "</div>";

                    $('#msg').append(responseStr);
                    chatBox.scrollTop(chatBox[0].scrollHeight); // 스크롤 이동
                },
                error: function(){
                    var errorStr = "<div class='message-container'>";
                    errorStr +=   "<div class='response-message'>죄송합니다. 서버 오류로 답변이 불가능합니다.</div>";
                    errorStr += "</div>";
                    $('#msg').append(errorStr);
                    chatBox.scrollTop(chatBox[0].scrollHeight); // 스크롤 이동
                }
            });
        }

        // 폼 제출 이벤트 처리
        $("#questionForm").on("submit", function(event){
            event.preventDefault(); // 폼의 기본 동작 중지
            sendQuestion();
        });
    });
</script>
